# СПИСКИ: ИНДЕКСЫ И СРЕЗЫ.

a = [43, 54, 2, 54, 32]

# 1. Получить элемент списка:

print(a[0], a[4])

print(a[-1])

b = [3, 4, 5, 6, 7, 8, 9, 10, 11]

print(b)
print(b[-1])
print(b[1:4])
print(b[2:-1])
print(b[2:])
print(b[:2])
print(b[:])

# С шагом 2:
print(b[::2])

# Остальные:
print(b[1::2])

# С шагом 3:
print(b[3:6:3])

# Перевернуть список:
print(b[::-1])

# С конца списка каждый второй элемент:
print(b[::-2])

# Список - объект изменяемый. По индексу можно поместить новое значение:
print(b)
b[2] = 100
print(b)

# Присвоение срезам индексов новых значений:
b[3:5] = 34, 23
print(b)

b[2:5] = 23, 34
print(b)

del b[2]
print(b)

# Изменение переменных, ссылающихся на один и тот же список:
a = [1, 2, 3]
d = a
print(a)
print(d)
b[2] = a
print(b)
print(a, d)
d[1] = 100
print(d)
print(a)

# Сохранение среза списка:
a = [1, 2, 3]
d = a[:]
print(d)
d[1] = 100
print(d)
print(a)


