# Вложенные списки (список внутри списка).
a = [[0, 2, 4, 6], [1, 5, 9, 13], [3, 10, [4, 5, 7, 11], 17, 19]]

# Ctrl + Alt + L - для форматирования согласно PEP8
print(len(a))
print(a[2])
print(len(a[2]))
print(a[2][3])
print(a[0][3])
print(a[2][2][1])

b = ['hello', 'hi', 'world']
print(b[2])
print(b[2][2])
print(b[2][-1])

# Матрицы (таблицы).
a = [
    [0, 2, 4, 6],
    [1, 5, 9, 13],
    [3, 10, 17, 19]
]
# Обойти все элементы списка:
print('1. Обход элементов списка по значению:')
for i in a:
    for j in i:
        print(j, end=' ')
    print()

# сам список не меняется:
for i in a:
    for j in i:
        j += 10
        print(j, end=' ')
    print()

print(a)

print('2. Обход элементов списка по индексам:')