# Срезы списков. Операторы сравнения списков
lst = ["Москва", "Уфа", "Тверь", "Казань"]
print(lst[1:3])

a = lst[1:3]
a[0] = "Воронеж"
print(a)

print(lst[:3])

print("Создание копии списка")
cities = lst[:]
print(cities)
print(id(lst))
print(id(cities))

c = list(lst)
print(c)

d = lst
print(id(d), id(lst))

marks = [2, 3, 4, 3, 5, 2]
print(marks[2:-1])
print(marks[-3:-1])
print(marks[1:5:2])
print(marks[:5:2])
print(marks[1::2])
print(marks[::2])
print(marks[::-1])

print("Групповое присваивание")
marks[2:4] = ["хорошо", "удовлетворительно"]
print(marks)

marks[::2] = [0, 0, 0]
print(marks)

marks[2:4] = 10, 20
print(marks)

print("Сравнение списков")
print([1, 2, 3] == [1, 2, 3])
print([10, 2, 3] > [1, 2, 3])
print([1, 2, 3, 5] > [1, 2, 3])
print([1, 2, 'abc'] > [1, 2, 'abc'])
print([1, 2, 3, "4"] > [1, 2, 3, "5"])

# Подвиг 5. Имеется список с оценками студента:
# m = [2, 3, 5, 5, 2, 2, 3, 3, 4, 5, 4, 4]
# Необходимо с помощью срезов выбрать элементы с 3-го по 7-й (включительно) и вывести их на экран в обратном порядке.
m = [2, 3, 5, 5, 2, 2, 3, 3, 4, 5, 4, 4]
print(m[6:1:-1])

#
m = [2, 3, 5, 5, 2, 2, 3, 3, 4, 5, 4, 4]
print(m[2:7][::-1])

#
m = [2, 3, 5, 5, 2, 2, 3, 3, 4, 5, 4, 4]
v = m[2:7:]
print(v[::-1])

